app/Http/Controllers/WatchListController.php

SELECT * FROM `movies` WHERE `name` = 'Captain Marvel' and `release_dt` = '08 Mar 2019' LIMIT 1
INSERT INTO `movies` (`name`, `rated`, `length`, `release_dt`, `poster`) VALUES ('The Boss Baby', 'PG', '97 min', '31 Mar 2017', 'https://m.media-amazon.com/images/M/MV5BMTg5MzUxNzgxNV5BMl5BanBnXkFtZTgwMTM2NzQ3MjI@._V1_SX300.jpg')
SELECT * FROM `actors` WHERE `name` = '' LIMIT 1
INSERT INTO `actors` (`name`) VALUES ('')
---
    public function store(Request $request)
    {
        // validating the request
        $validateDataMovie = $request->validate([
            'name' => 'required|max:250',
            'rated' => 'max:10',
            'length' => 'max:50',
            'release_dt' => 'required|max:100',
            'poster' => 'max:255',
        ]);

        $msg = "Film $request->name berhasil ditambahkan!";

        // creating the movie if it doesn't exist
        if (Movie::where('name', $request->name)->where('release_dt', $request->release_dt)->first() == null) {
            $movie_id = Movie::create($validateDataMovie)->id;

            $actors = explode(', ', $request->actors);
            $genres = explode(', ', $request->genre);

            $actors_id = array();
            $genres_id = array();

            foreach ($actors as $key => $value) {
                if (Actor::where('name', $value)->first() == null) {
                    $id = Actor::create([
                        'name' => $value
                    ])->id;

SELECT * FROM `genres` WHERE `name` = '' LIMIT 1
INSERT INTO `genres` (`name`) VALUES ('')
---
            }

            foreach ($genres as $key => $value) {
                if (Genre::where('name', $value)->first() == null) {
                    $id = Genre::create([
                        'name' => $value
                    ])->id;

SELECT * FROM `movie_actors` WHERE `movie_id` = 8 and `actor_id` IS NULL LIMIT 1
---
            }

            foreach ($actors_id as $key => $actor_id) {
                if (MovieActor::where('movie_id', $movie_id)->where('actor_id', $actor_id)->first() == null) {

SELECT * FROM `movies` WHERE `name` = 'Captain Marvel' and `release_dt` = '08 Mar 2019' LIMIT 1
---
                }
            }
        } else {
            $movie_id = Movie::where('name', $request->name)->where('release_dt', $request->release_dt)->first()['movie_id'];

SELECT * FROM `watch_lists` WHERE `user_id` = 3 and `movie_id` = 2 LIMIT 1
---
        $user_id = auth()->user()->id;

        // creating the watchlist if it doesn't exist
        if (WatchList::where('user_id', $user_id)->where('movie_id', $movie_id)->first() == null) {